msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
/*
 *   Name: USART.cpp
 *
 *   Copyright (c) Mateusz Semegen and contributors. All rights reserved.
 *   Licensed under the MIT license. See LICENSE file in the project root for details.
 */

#ifdef STM32L4

// this
#include <soc/m4/stm32l4/peripherals/RS485.hpp>
#include <soc/m4/stm32l4/peripherals/USART.hpp>

// soc
#include <soc/Interrupt_guard.hpp>
#include <soc/m4/stm32l4/peripherals/GPIO.hpp>
#include <soc/system_timer.hpp>

// cml
#include <cml/bit.hpp>
#include <cml/bit_flag.hpp>
#include <cml/debug/assertion.hpp>
#include <cml/utils/wait_until.hpp>
#include <cml/various.hpp>

// externals
#include <stm32l4xx.h>

namespace {

using namespace cml;
using namespace soc;
using namespace soc::m4::stm32l4::peripherals;

struct Controller
{
    USART_TypeDef* p_registers = nullptr;
    USART* p_usart_handle      = nullptr;
    RS485* p_rs485_handle      = nullptr;
};

Controller controllers[] = { { USART1, nullptr, nullptr },
                             { USART2, nullptr, nullptr },
#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L433xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
                             { USART3, nullptr, nullptr }
#endif
};

USART_TypeDef* get_usart_ptr(USART::Id a_id)
{
    return controllers[static_cast<uint32_t>(a_id)].p_registers;
}

bool is_USART_ISR_error(USART::Id a_id)
{
    return bit::is_any(get_usart_ptr(a_id)->ISR, USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE);
}

USART::Bus_status_flag get_bus_status_flag_from_USART_ISR(USART::Id a_id)
{
    USART::Bus_status_flag ret = USART::Bus_status_flag::ok;
    const uint32_t isr         = get_usart_ptr(a_id)->ISR;

    if (true == bit_flag::is(isr, USART_ISR_PE))
    {
        ret |= USART::Bus_status_flag::parity_error;
    }

    if (true == bit_flag::is(isr, USART_ISR_FE))
    {
        ret |= USART::Bus_status_flag::framing_error;
    }

    if (true == bit_flag::is(isr, USART_ISR_ORE))
    {
        ret |= USART::Bus_status_flag::overrun;
    }

    if (true == bit_flag::is(isr, USART_ISR_NE))
    {
        ret |= USART::Bus_status_flag::noise_detected;
    }

    return ret;
}

void clear_USART_ISR_errors(USART::Id a_id)
{
    bit_flag::set(&(get_usart_ptr(a_id)->ICR), USART_ICR_PECF | USART_ICR_FECF | USART_ICR_ORECF | USART_ICR_NECF);
}

} // namespace

extern "C" {

static void interrupt_handler(uint32_t a_index)
{
    cml_assert((nullptr != controllers[a_index].p_usart_handle && nullptr == controllers[a_index].p_rs485_handle) ||
               (nullptr == controllers[a_index].p_usart_handle && nullptr != controllers[a_index].p_rs485_handle));

    if (nullptr != controllers[a_index].p_usart_handle)
    {
        usart_interrupt_handler(controllers[a_index].p_usart_handle);
    }
    else if (nullptr != controllers[a_index].p_rs485_handle)
    {
        rs485_interrupt_handler(controllers[a_index].p_rs485_handle);
    }
}

void USART1_IRQHandler()
{
    interrupt_handler(0);
}

void USART2_IRQHandler()
{
    interrupt_handler(1);
}

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L433xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
void USART3_IRQHandler()
{
    interrupt_handler(2);
}
#endif


} // extern "C"

namespace soc {
namespace m4 {
namespace stm32l4 {
namespace peripherals {

using namespace cml;
using namespace cml::utils;

void usart_interrupt_handler(USART* a_p_this)
{
    cml_assert(nullptr != a_p_this);

    const uint32_t isr = get_usart_ptr(a_p_this->id)->ISR;
    const uint32_t cr1 = get_usart_ptr(a_p_this->id)->CR1;
    const uint32_t cr3 = get_usart_ptr(a_p_this->id)->CR3;

    if (nullptr != a_p_this->transmit_callback.function)
    {
        if (true == bit_flag::is(isr, USART_ISR_TXE) && true == bit_flag::is(cr1, USART_CR1_TXEIE))
        {
            a_p_this->transmit_callback.function(
                &(get_usart_ptr(a_p_this->id)->TDR), false, a_p_this, a_p_this->transmit_callback.p_user_data);
        }

        if (true == bit_flag::is(isr, USART_ISR_TC) && true == bit_flag::is(cr1, USART_CR1_TCIE))
        {
            a_p_this->transmit_callback.function(nullptr, true, a_p_this, a_p_this->transmit_callback.p_user_data);
        }
    }

    if (nullptr != a_p_this->receive_callback.function)
    {
        if (true == bit_flag::is(isr, USART_ISR_RXNE) && true == bit_flag::is(cr1, USART_CR1_RXNEIE))
        {
            a_p_this->receive_callback.function(
                get_usart_ptr(a_p_this->id)->RDR, false, a_p_this, a_p_this->receive_callback.p_user_data);
        }
        else if (true == bit_flag::is(isr, USART_ISR_IDLE) && true == bit_flag::is(cr1, USART_CR1_IDLEIE))
        {
            bit_flag::set(&(get_usart_ptr(a_p_this->id)->ICR), USART_ICR_IDLECF);
            a_p_this->receive_callback.function(0x0u, true, a_p_this, a_p_this->receive_callback.p_user_data);
        }
    }

    if (true == bit_flag::is(cr3, USART_CR3_EIE) && true == bit_flag::is(cr1, USART_CR1_PEIE))
    {
        USART::Bus_status_flag status = get_bus_status_flag_from_USART_ISR(a_p_this->id);

        if (status != USART::Bus_status_flag::ok)
        {
            if (nullptr != a_p_this->bus_status_callback.function)
            {
                a_p_this->bus_status_callback.function(status, a_p_this, a_p_this->bus_status_callback.p_user_data);
            }

            clear_USART_ISR_errors(a_p_this->id);
        }
    }
}

void rs485_interrupt_handler(RS485* a_p_this)
{
    cml_assert(nullptr != a_p_this);

    const uint32_t isr = get_usart_ptr(a_p_this->id)->ISR;
    const uint32_t cr1 = get_usart_ptr(a_p_this->id)->CR1;
    const uint32_t cr3 = get_usart_ptr(a_p_this->id)->CR3;

