msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
    if (nullptr != a_p_this->transmit_callback.function)
    {
        if (true == bit_flag::is(isr, USART_ISR_TXE) && true == bit_flag::is(cr1, USART_CR1_TXEIE))
        {
            a_p_this->transmit_callback.function(
                &(get_usart_ptr(a_p_this->id)->TDR), false, a_p_this, a_p_this->transmit_callback.p_user_data);
        }

        if (true == bit_flag::is(isr, USART_ISR_TC) && true == bit_flag::is(cr1, USART_CR1_TCIE))
        {
            a_p_this->transmit_callback.function(nullptr, true, a_p_this, a_p_this->transmit_callback.p_user_data);
        }
    }

    if (nullptr != a_p_this->receive_callback.function)
    {
        if (true == bit_flag::is(isr, USART_ISR_RXNE) && true == bit_flag::is(cr1, USART_CR1_RXNEIE))
        {
            volatile uint16_t rdr = get_usart_ptr(a_p_this->id)->RDR;

            if (false == bit_flag::is(rdr, 0x100))
            {
                a_p_this->receive_callback.function(rdr, false, a_p_this, a_p_this->receive_callback.p_user_data);
            }
        }
        else if (true == bit_flag::is(isr, USART_ISR_IDLE) && true == bit_flag::is(cr1, USART_CR1_IDLEIE))
        {
            bit_flag::set(&(get_usart_ptr(a_p_this->id)->ICR), USART_ICR_IDLECF);
            a_p_this->receive_callback.function(0x0u, true, a_p_this, a_p_this->receive_callback.p_user_data);
        }
    }

    if (true == bit_flag::is(cr3, USART_CR3_EIE) && true == bit_flag::is(cr1, USART_CR1_PEIE))
    {
        USART::Bus_status_flag status = get_bus_status_flag_from_USART_ISR(a_p_this->id);

        if (status != USART::Bus_status_flag::ok)
        {
            if (nullptr != a_p_this->bus_status_callback.function)
            {
                a_p_this->bus_status_callback.function(status, a_p_this, a_p_this->bus_status_callback.p_user_data);
            }

            clear_USART_ISR_errors(a_p_this->id);
        }
    }
}

bool USART::enable(const Config& a_config,
                   const Frame_format& a_frame_format,
                   uint32_t a_irq_priority,
                   uint32_t a_timeout_ms)
{
    cml_assert(0 != a_config.baud_rate);
    cml_assert(0 != a_config.clock_freq_Hz);

    cml_assert(various::get_enum_incorrect_value<Flow_control_flag>() != a_config.flow_control);
    cml_assert(various::get_enum_incorrect_value<Stop_bits>() != a_config.stop_bits);
    cml_assert(various::get_enum_incorrect_value<Sampling_method>() != a_config.sampling_method);

    cml_assert(various::get_enum_incorrect_value<Parity>() != a_frame_format.parity);
    cml_assert(various::get_enum_incorrect_value<Word_length>() != a_frame_format.word_length);

    cml_assert(a_timeout_ms > 0);

    cml_assert(nullptr == controllers[static_cast<uint32_t>(this->id)].p_usart_handle &&
               nullptr == controllers[static_cast<uint32_t>(this->id)].p_rs485_handle);

    uint32_t start = system_timer::get();

    controllers[static_cast<uint32_t>(this->id)].p_usart_handle = this;
    controllers[static_cast<uint32_t>(this->id)].p_rs485_handle = nullptr;

    switch (a_config.oversampling)
    {
        case Oversampling::_16: {
            get_usart_ptr(this->id)->BRR = a_config.clock_freq_Hz / a_config.baud_rate;
        }
        break;

        case Oversampling::_8: {
            const uint32_t usartdiv      = 2 * a_config.clock_freq_Hz / a_config.baud_rate;
            get_usart_ptr(this->id)->BRR = ((usartdiv & 0xFFF0u) | ((usartdiv & 0xFu) >> 1)) & 0xFFFF;
        }
        break;
    }

    get_usart_ptr(this->id)->CR2 = static_cast<uint32_t>(a_config.stop_bits);
    get_usart_ptr(this->id)->CR3 =
        static_cast<uint32_t>(a_config.flow_control) | static_cast<uint32_t>(a_config.sampling_method);

    get_usart_ptr(this->id)->CR1 = static_cast<uint32_t>(a_config.oversampling) | static_cast<uint32_t>(a_config.mode) |
                                   static_cast<uint32_t>(a_frame_format.parity) |
                                   static_cast<uint32_t>(a_frame_format.word_length) | USART_CR1_UE;

    this->baud_rate     = a_config.baud_rate;
    this->clock_freq_Hz = a_config.clock_freq_Hz;
    this->frame_format  = a_frame_format;

    uint32_t wait_flag = (true == bit_flag::is(get_usart_ptr(this->id)->CR1, USART_CR1_RE) ? USART_ISR_REACK : 0) |
                         (true == bit_flag::is(get_usart_ptr(this->id)->CR1, USART_CR1_TE) ? USART_ISR_TEACK : 0);

    NVIC_SetPriority(
        static_cast<IRQn_Type>(static_cast<uint32_t>(IRQn_Type::USART1_IRQn) + static_cast<uint32_t>(this->id)),
        a_irq_priority);
    NVIC_EnableIRQ(
        static_cast<IRQn_Type>(static_cast<uint32_t>(IRQn_Type::USART1_IRQn) + static_cast<uint32_t>(this->id)));

    return wait_until::all_bits(&(get_usart_ptr(this->id)->ISR), wait_flag, false, start, a_timeout_ms);
}

void USART::disable()
{
    NVIC_DisableIRQ(
        static_cast<IRQn_Type>(static_cast<uint32_t>(IRQn_Type::USART1_IRQn) + static_cast<uint32_t>(this->id)));

    get_usart_ptr(this->id)->CR1 = 0;
    get_usart_ptr(this->id)->CR2 = 0;
    get_usart_ptr(this->id)->CR3 = 0;

    controllers[static_cast<uint32_t>(this->id)].p_usart_handle = nullptr;
}

USART::Result USART::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error)
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE) && words < a_data_size_in_words)
        {
            if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint16_t*>(a_p_data)[words++]) & 0x1FFu;
            }
            else
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint8_t*>(a_p_data)[words++]) & 0xFFu;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

