msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

USART::Result USART::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_words, uint32_t a_timeout_ms)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);
    cml_assert(a_timeout_ms > 0);

    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error &&
           a_timeout_ms < various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE) && words < a_data_size_in_words)
        {
            if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint16_t*>(a_p_data)[words++]) & 0x1FFu;
            }
            else
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint8_t*>(a_p_data)[words++]) & 0xFFu;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

USART::Result USART::transmit_word(uint16_t a_word)
{
    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error)
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE) && 0 == words)
        {
            if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
            {
                get_usart_ptr(this->id)->TDR = a_word & 0x1FFu;
            }
            else
            {
                get_usart_ptr(this->id)->TDR = a_word & 0xFFu;
            }

            words++;
        }

        error = is_USART_ISR_error(this->id);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

USART::Result USART::transmit_word(uint16_t a_word, uint32_t a_timeout_ms)
{
    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error &&
           a_timeout_ms < various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE) && 0 == words)
        {
            if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
            {
                get_usart_ptr(this->id)->TDR = a_word & 0x1FFu;
            }
            else
            {
                get_usart_ptr(this->id)->TDR = a_word & 0xFFu;
            }

            words++;
        }
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

USART::Result USART::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_IDLE) && false == error)
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_RXNE))
        {
            if (words < a_data_size_in_words)
            {
                if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
                {
                    static_cast<uint16_t*>(a_p_data)[words++] = (get_usart_ptr(this->id)->RDR & 0x1FFu);
                }
                else
                {
                    static_cast<uint8_t*>(a_p_data)[words++] = (get_usart_ptr(this->id)->RDR & 0xFFu);
                }
            }
            else
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                words++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

USART::Result USART::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words, uint32_t a_timeout_ms)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);
    cml_assert(a_timeout_ms > 0);

