msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);

    uint32_t ret               = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_IDLE) && false == error &&
           a_timeout_ms >= various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_RXNE))
        {
            if (ret < a_data_size_in_words)
            {
                if (Parity::none == this->frame_format.parity && Word_length::_9_bit == this->frame_format.word_length)
                {
                    static_cast<uint16_t*>(a_p_data)[ret++] = (get_usart_ptr(this->id)->RDR & 0x1FFu);
                }
                else
                {
                    static_cast<uint8_t*>(a_p_data)[ret++] = (get_usart_ptr(this->id)->RDR & 0xFFu);
                }
            }
            else
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                ret++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, ret };
}

void USART::register_transmit_callback(const Transmit_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->transmit_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_TXEIE | USART_CR1_TCIE);
}

void USART::register_receive_callback(const Receive_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->receive_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_RXNEIE | USART_CR1_IDLEIE);
}

void USART::register_bus_status_callback(const Bus_status_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->bus_status_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_PEIE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR3), USART_CR3_EIE);
}

void USART::unregister_transmit_callback()
{
    Interrupt_guard guard;

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_TXEIE | USART_CR1_TCIE);

    this->transmit_callback = { nullptr, nullptr };
}

void USART::unregister_receive_callback()
{
    Interrupt_guard guard;

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_RXNEIE | USART_CR1_IDLEIE);

    this->receive_callback = { nullptr, nullptr };
}

void USART::unregister_bus_status_callback()
{
    Interrupt_guard guard;

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_PEIE);
    bit_flag::clear(&(get_usart_ptr(this->id)->CR3), USART_CR3_EIE);

    this->bus_status_callback = { nullptr, nullptr };
}

void USART::set_baud_rate(uint32_t a_baud_rate)
{
    cml_assert(0 != a_baud_rate);

    const Oversampling oversampling = this->get_oversampling();

    switch (oversampling)
    {
        case Oversampling::_8: {
            const uint32_t usartdiv      = 2 * this->clock_freq_Hz / a_baud_rate;
            get_usart_ptr(this->id)->BRR = ((usartdiv & 0xFFF0u) | ((usartdiv & 0xFu) >> 1)) & 0xFFFF;
        }
        break;

        case Oversampling::_16: {
            get_usart_ptr(this->id)->BRR = this->clock_freq_Hz / a_baud_rate;
        }
        break;
    }
}

void USART::set_oversampling(Oversampling a_oversampling)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), static_cast<uint32_t>(a_oversampling));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

void USART::set_stop_bits(Stop_bits a_stop_bits)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR2), static_cast<uint32_t>(a_stop_bits));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

void USART::set_flow_control(Flow_control_flag a_flow_control)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR3), static_cast<uint32_t>(a_flow_control));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

void USART::set_sampling_method(Sampling_method a_sampling_method)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR3), USART_CR3_ONEBIT, static_cast<uint32_t>(a_sampling_method));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

void USART::set_frame_format(const Frame_format& a_frame_format)
{
    cml_assert(various::get_enum_incorrect_value<Word_length>() != a_frame_format.word_length);
    cml_assert(various::get_enum_incorrect_value<Parity>() != a_frame_format.parity);

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1),
                  USART_CR1_PCE | USART_CR1_M,
                  static_cast<uint32_t>(a_frame_format.parity) | static_cast<uint32_t>(a_frame_format.word_length) |
                      USART_CR1_UE);

    this->frame_format = a_frame_format;
}

bool USART::set_mode(Mode_flag a_mode, uint32_t a_timeout_ms)
{
    cml_assert(a_timeout_ms > 0);

    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_TE | USART_CR1_RE, static_cast<uint32_t>(a_mode));

    uint32_t wait_flag = (true == bit_flag::is(get_usart_ptr(this->id)->CR1, USART_CR1_RE) ? USART_ISR_REACK : 0) |
                         (true == bit_flag::is(get_usart_ptr(this->id)->CR1, USART_CR1_TE) ? USART_ISR_TEACK : 0);

