msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
    return wait_until::all_bits(&(get_usart_ptr(this->id)->ISR), wait_flag, false, start, a_timeout_ms);
}

USART::Oversampling USART::get_oversampling() const
{
    return static_cast<Oversampling>(
        bit_flag::get(get_usart_ptr(this->id)->CR1, static_cast<uint32_t>(USART_CR1_OVER8)));
}

USART::Stop_bits USART::get_stop_bits() const
{
    return static_cast<Stop_bits>(bit_flag::get(get_usart_ptr(this->id)->CR2, USART_CR2_STOP));
}

USART::Flow_control_flag USART::get_flow_control() const
{
    return static_cast<Flow_control_flag>(bit_flag::get(get_usart_ptr(this->id)->CR3, USART_CR3_RTSE | USART_CR3_CTSE));
}

USART::Sampling_method USART::get_sampling_method() const
{
    return static_cast<Sampling_method>(bit_flag::get(get_usart_ptr(this->id)->CR3, USART_CR3_ONEBIT));
}

USART::Mode_flag USART::get_mode() const
{
    return static_cast<Mode_flag>(bit_flag::get(get_usart_ptr(this->id)->CR1, USART_CR1_TE | USART_CR1_RE));
}

bool USART::is_enabled() const
{
    return bit_flag::is(controllers[static_cast<uint32_t>(this->id)].p_registers->CR1, USART_CR1_UE);
}

bool RS485::enable(const Config& a_config,
                   GPIO::Out::Pin* a_p_flow_control_pin,
                   uint32_t a_irq_priority,
                   uint32_t a_timeout)
{
    cml_assert(nullptr != a_p_flow_control_pin);

    cml_assert(0 != a_config.baud_rate);
    cml_assert(0 != a_config.clock_freq_Hz);

    cml_assert(various::get_enum_incorrect_value<Stop_bits>() != a_config.stop_bits);
    cml_assert(various::get_enum_incorrect_value<Oversampling>() != a_config.oversampling);

    cml_assert(a_timeout > 0);

    cml_assert(nullptr == controllers[static_cast<uint32_t>(this->id)].p_usart_handle &&
               nullptr == controllers[static_cast<uint32_t>(this->id)].p_rs485_handle);

    uint32_t start = system_timer::get();

    controllers[static_cast<uint32_t>(this->id)].p_rs485_handle = this;
    controllers[static_cast<uint32_t>(this->id)].p_usart_handle = nullptr;

    switch (a_config.oversampling)
    {
        case Oversampling::_16: {
            get_usart_ptr(this->id)->BRR = a_config.clock_freq_Hz / a_config.baud_rate;
        }
        break;

        case Oversampling::_8: {
            const uint32_t usartdiv      = 2 * a_config.clock_freq_Hz / a_config.baud_rate;
            get_usart_ptr(this->id)->BRR = ((usartdiv & 0xFFF0u) | ((usartdiv & 0xFu) >> 1)) & 0xFFFF;
        }
        break;
    }

    get_usart_ptr(this->id)->CR3 = USART_CR3_ONEBIT;
    get_usart_ptr(this->id)->CR2 =
        static_cast<uint32_t>(a_config.stop_bits) | (a_config.address << USART_CR2_ADD_Pos) | USART_CR2_ADDM7;

    get_usart_ptr(this->id)->CR1 = static_cast<uint32_t>(a_config.oversampling) | USART_CR1_M0 | USART_CR1_UE |
                                   USART_CR1_TE | USART_CR1_RE | USART_CR1_MME | USART_CR1_WAKE;

    get_usart_ptr(this->id)->RQR = USART_RQR_MMRQ;

    this->p_flow_control_pin = a_p_flow_control_pin;
    this->baud_rate          = a_config.baud_rate;
    this->clock_freq_Hz      = a_config.clock_freq_Hz;

    bool ret = wait_until::all_bits(
        &(get_usart_ptr(this->id)->ISR), USART_ISR_TEACK | USART_ISR_REACK | USART_ISR_RWU, false, start, a_timeout);

    if (true == ret)
    {
        this->p_flow_control_pin->set_level(GPIO::Level::low);
    }

    return ret;
}

void RS485::disable()
{
    get_usart_ptr(this->id)->CR1 = 0;
    get_usart_ptr(this->id)->CR2 = 0;
    get_usart_ptr(this->id)->CR3 = 0;
    get_usart_ptr(this->id)->RQR = 0;

    controllers[static_cast<uint32_t>(this->id)].p_rs485_handle = nullptr;

    this->p_flow_control_pin = nullptr;
}

RS485::Result RS485::transmit_bytes_polling(uint8_t a_address, const void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(a_address <= 0x7F);
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    this->p_flow_control_pin->set_level(GPIO::Level::high);

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error)
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE))
        {
            if (words == 0)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<uint16_t>(a_address) | static_cast<uint16_t>(0x100u));
                words++;
            }
            else if (words < a_data_size_in_words + 1)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint8_t*>(a_p_data)[words - 1]);
                words++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    this->p_flow_control_pin->set_level(GPIO::Level::low);

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

RS485::Result RS485::transmit_bytes_polling(uint8_t a_address,
                                            const void* a_p_data,
                                            uint32_t a_data_size_in_words,
                                            uint32_t a_timeout_ms)
{
    cml_assert(a_address <= 0x7F);
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);
    cml_assert(a_timeout_ms > 0);

    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    this->p_flow_control_pin->set_level(GPIO::Level::high);

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TC) && false == error &&
           a_timeout_ms < various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_TXE))
        {
            if (words == 0)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<uint16_t>(a_address) | static_cast<uint16_t>(0x100u));
                words++;
            }
            else if (words < a_data_size_in_words + 1)
            {
                get_usart_ptr(this->id)->TDR = (static_cast<const uint8_t*>(a_p_data)[words - 1]);
                words++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    this->p_flow_control_pin->set_level(GPIO::Level::low);

