msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

RS485::Result RS485::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_IDLE) && false == error)
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_RXNE))
        {
            if (0 == words)
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                words++;
            }
            else if (words < a_data_size_in_words + 1)
            {
                static_cast<uint8_t*>(a_p_data)[words - 1] = (get_usart_ptr(this->id)->RDR & 0xFFu);
                words++;
            }
            else
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                words++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_CMCF);

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

RS485::Result RS485::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words, uint32_t a_timeout_ms)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);
    cml_assert(a_timeout_ms > 0);

    uint32_t start = system_timer::get();

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);

    uint32_t words             = 0;
    bool error                 = false;
    Bus_status_flag bus_status = Bus_status_flag::ok;

    while (false == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_IDLE) && false == error &&
           a_timeout_ms >= various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_usart_ptr(this->id)->ISR, USART_ISR_RXNE))
        {
            if (0 == words)
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                words++;
            }
            else if (words < a_data_size_in_words + 1)
            {
                static_cast<uint8_t*>(a_p_data)[words - 1] = (get_usart_ptr(this->id)->RDR & 0xFFu);
                words++;
            }
            else
            {
                bit_flag::set(&(get_usart_ptr(this->id)->RQR), USART_RQR_RXFRQ);
                words++;
            }
        }

        error = is_USART_ISR_error(this->id);
    }

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_CMCF);

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_USART_ISR(this->id);

        if (Bus_status_flag::ok != bus_status)
        {
            clear_USART_ISR_errors(this->id);
        }
    }

    return { bus_status, words };
}

void RS485::register_transmit_callback(const Transmit_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->transmit_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_TCCF);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_TCIE | USART_CR1_TXEIE);

    this->p_flow_control_pin->set_level(GPIO::Level::high);
}

void RS485::register_receive_callback(const Receive_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->receive_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_IDLECF);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_RXNEIE | USART_CR1_IDLEIE);
}

void RS485::register_bus_status_callback(const Bus_status_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->bus_status_callback = a_callback;

    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_PEIE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR3), USART_CR3_EIE);
}

void RS485::unregister_transmit_callback()
{
    Interrupt_guard guard;

    this->p_flow_control_pin->set_level(GPIO::Level::low);

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_TCIE | USART_CR1_TXEIE);

    this->transmit_callback = { nullptr, nullptr };
}

void RS485::unregister_receive_callback()
{
    Interrupt_guard guard;

    bit_flag::set(&(get_usart_ptr(this->id)->ICR), USART_ICR_CMCF);
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_RXNEIE);

    this->receive_callback = { nullptr, nullptr };
}

void RS485::unregister_bus_status_callback()
{
    Interrupt_guard guard;

    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_PEIE);
    bit_flag::clear(&(get_usart_ptr(this->id)->CR3), USART_CR3_EIE);

    this->bus_status_callback = { nullptr, nullptr };
}

void RS485::set_baud_rate(uint32_t a_baud_rate)
{
    cml_assert(0 != a_baud_rate);

    const Oversampling oversampling = this->get_oversampling();

    switch (oversampling)
    {
        case Oversampling::_8: {
            const uint32_t usartdiv      = 2 * this->clock_freq_Hz / a_baud_rate;
            get_usart_ptr(this->id)->BRR = ((usartdiv & 0xFFF0u) | ((usartdiv & 0xFu) >> 1)) & 0xFFFF;
        }
        break;

        case Oversampling::_16: {
            get_usart_ptr(this->id)->BRR = this->clock_freq_Hz / a_baud_rate;
        }
        break;
    }
}

