msemegen/CML/lib/soc/m4/stm32l4/peripherals/USART.cpp
void RS485::set_oversampling(Oversampling a_oversampling)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), static_cast<uint32_t>(a_oversampling));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

void RS485::set_stop_bits(Stop_bits a_stop_bits)
{
    bit_flag::clear(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
    bit_flag::set(&(get_usart_ptr(this->id)->CR2), static_cast<uint32_t>(a_stop_bits));
    bit_flag::set(&(get_usart_ptr(this->id)->CR1), USART_CR1_UE);
}

bool RS485::is_enabled() const
{
    return bit_flag::is(controllers[static_cast<uint32_t>(this->id)].p_registers->CR1, USART_CR1_UE);
}

RS485::Oversampling RS485::get_oversampling() const
{
    return static_cast<Oversampling>(
        bit_flag::get(get_usart_ptr(this->id)->CR1, static_cast<uint32_t>(USART_CR1_OVER8)));
}

RS485::Stop_bits RS485::get_stop_bits() const
{
    return static_cast<Stop_bits>(bit_flag::get(get_usart_ptr(this->id)->CR2, USART_CR2_STOP));
}


} // namespace peripherals
} // namespace stm32l4
} // namespace m4
} // namespace soc

namespace soc {
namespace m4 {
namespace stm32l4 {

using namespace soc::m4::stm32l4::peripherals;

void rcc<USART>::enable(USART::Id a_id, const Clock_source& a_clock_source, bool a_enable_in_lp)
{
    const uint32_t clock_source_lut[] = { 0,
                                          0x1ul << static_cast<uint32_t>(a_id) * 2ul,
                                          0x2ul << static_cast<uint32_t>(a_id) * 2ul };
    bit_flag::set(&(RCC->CCIPR),
                  0x3ul << (static_cast<uint32_t>(a_id) * 2ul),
                  clock_source_lut[static_cast<uint32_t>(a_clock_source)]);

    if (USART::Id::_1 == a_id)
    {
        bit::set(&(RCC->APB2ENR), RCC_APB2ENR_USART1EN_Pos);
    }
    else
    {
        bit::set(&(RCC->APB1ENR1), RCC_APB1ENR1_USART2EN_Pos + static_cast<uint32_t>(a_id) - 1u);
    }

    if (true == a_enable_in_lp)
    {
        if (USART::Id::_1 == a_id)
        {
            bit::set(&(RCC->APB2SMENR), RCC_APB2SMENR_USART1SMEN_Pos);
        }
        else
        {
            bit::set(&(RCC->APB1SMENR1), RCC_APB1SMENR1_USART2SMEN_Pos + static_cast<uint32_t>(a_id) - 1);
        }
    }
}

void rcc<USART>::disable(USART::Id a_id)
{
    bit_flag::clear(&(RCC->CCIPR), 0x3ul << (static_cast<uint32_t>(a_id) * 2ul));

    if (USART::Id::_1 == a_id)
    {
        bit::clear(&(RCC->APB2ENR), RCC_APB2ENR_USART1EN_Pos);
        bit::clear(&(RCC->APB2SMENR), RCC_APB2SMENR_USART1SMEN_Pos);
    }
    else
    {
        bit::clear(&(RCC->APB1ENR1), RCC_APB1ENR1_USART2EN_Pos + static_cast<uint32_t>(a_id) - 1u);
        bit::clear(&(RCC->APB1SMENR1), RCC_APB1SMENR1_USART2SMEN_Pos + static_cast<uint32_t>(a_id) - 1);
    }
}

} // namespace stm32l4
} // namespace m4
} // namespace soc

#endif // STM32L4